nxp-mcuxpresso/mcux-soc-svd/MCXN557S/MCXN557S_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>TSI0</name>
      <description>TSI</description>
      <groupName>TSI</groupName>
      <baseAddress>0x40050000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x110</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TSI_END_OF_SCAN</name>
        <value>101</value>
      </interrupt>
      <interrupt>
        <name>TSI_OUT_OF_SCAN</name>
        <value>102</value>
      </interrupt>
      <registers>
        <register>
          <name>CONFIG</name>
          <description>TSI CONFIG (TSI_CONFIG) for Self-Capacitor</description>
          <alternateGroup>SELF</alternateGroup>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>self_cp</name>
                  <description>Self capacitance</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mtl_cp</name>
                  <description>Mutual capacitance</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSICH</name>
              <description>TSI Channel</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>self_cp_0</name>
                  <description>Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_1</name>
                  <description>Channel 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_2</name>
                  <description>Channel 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_3</name>
                  <description>Channel 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_4</name>
                  <description>Channel 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_5</name>
                  <description>Channel 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_6</name>
                  <description>Channel 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_7</name>
                  <description>Channel 7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_8</name>
                  <description>Channel 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_9</name>
                  <description>Channel 9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_10</name>
                  <description>Channel 10</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_11</name>
                  <description>Channel 11</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_12</name>
                  <description>Channel 12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_13</name>
                  <description>Channel 13</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_14</name>
                  <description>Channel 14</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_15</name>
                  <description>Channel 15</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_16</name>
                  <description>Channel 16</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_17</name>
                  <description>Channel 17</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_18</name>
                  <description>Channel 18</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_19</name>
                  <description>Channel 19</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_20</name>
                  <description>Channel 20</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_21</name>
                  <description>Channel 21</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_22</name>
                  <description>Channel 22</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_23</name>
                  <description>Channel 23</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_cp_24</name>
                  <description>Channel 24</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_NOISE</name>
              <description>Self-Capacitance Noise Cancelation</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_XCH</name>
              <description>Self-Capacitance Charge Current Multiple</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>def_16</name>
                  <description>1 / 16</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>def_8</name>
                  <description>1 / 8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>def_4</name>
                  <description>1 / 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>def_2</name>
                  <description>1 / 2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_XIN</name>
              <description>Self-Capacitance Input Current Multiple</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>xin_def_8</name>
                  <description>1 / 8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xin_def_4</name>
                  <description>1 / 4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_CTRIM</name>
              <description>Capacitor Trim Setting</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ctrim_25</name>
                  <description>2.5 pF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ctrim_5</name>
                  <description>5.0 pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ctrim_75</name>
                  <description>7.5 pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ctrim_10</name>
                  <description>10 pF</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ctrim_125</name>
                  <description>12.5 pF</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ctrim_15</name>
                  <description>15.0 pF</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ctrim_175</name>
                  <description>17.5 pF</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ctrim_20</name>
                  <description>20 pF</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_SEN</name>
              <description>Self-Capacitance Sensitivity Boost</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_XDN</name>
              <description>Self-Capacitance Discharge Current Multiple</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>xdn_def_16</name>
                  <description>1 / 16</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xdn_def_8</name>
                  <description>1 / 8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xdn_def_4</name>
                  <description>1 / 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xdn_def_2</name>
                  <description>1 / 2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_XIN_ADD</name>
              <description>S_XIN Adjust Ratio</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disables; S_XIN = 0 for 1 / 4, S_XIN = 1 for 1 / 8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enables; S_XIN = 0 for 1 / 8, S_XIN = 1 for 1 / 16</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
