nxp-mcuxpresso/mcux-soc-svd/MCXN557S/MCXN557S_cm33_core1.xml
        <register>
          <name>ADMA_ERR_STATUS</name>
          <description>ADMA Error Status</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADMAES</name>
              <description>ADMA error state (when ADMA error is occurred)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADMALME</name>
              <description>ADMA length mismatch error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADMAES_B</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADMAES_a</name>
                  <description>Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADMADCE</name>
              <description>ADMA descriptor error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADMADCE_B</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADMADCE_a</name>
                  <description>Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMA_SYS_ADDR</name>
          <description>ADMA System Address</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADS_ADDR</name>
              <description>ADMA system address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLL_CTRL</name>
          <description>DLL (Delay Line) Control</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLL_CTRL_ENABLE</name>
              <description>DLL and delay chain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_RESET</name>
              <description>DLL reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_FORCE_UPD</name>
              <description>DLL slave delay line</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_DLY_TARGET0</name>
              <description>DLL slave delay target0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_GATE_UPDATE</name>
              <description>DLL gate update</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_OVERRIDE</name>
              <description>DLL slave override</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_OVERRIDE_VAL</name>
              <description>DLL slave override val</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_DLY_TARGET1</name>
              <description>DLL slave delay target1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_UPDATE_INT</name>
              <description>Slave delay line update interval</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_REF_UPDATE_INT</name>
              <description>DLL control loop update interval</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLL_STATUS</name>
          <description>DLL Status</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLL_STS_SLV_LOCK</name>
              <description>Slave delay-line lock status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DLL_STS_REF_LOCK</name>
              <description>Reference DLL lock status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DLL_STS_SLV_SEL</name>
              <description>Slave delay line select status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DLL_STS_REF_SEL</name>
              <description>Reference delay line select taps</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_TUNE_CTRL_STATUS</name>
          <description>CLK Tuning Control and Status</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLY_CELL_SET_POST</name>
              <description>Delay cells on the feedback clock between CLK_OUT and CLK_POST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLY_CELL_SET_OUT</name>
              <description>Delay cells on the feedback clock between CLK_PRE and CLK_OUT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLY_CELL_SET_PRE</name>
              <description>delay cells on the feedback clock between the feedback clock and CLK_PRE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NXT_ERR</name>
              <description>NXT error</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TAP_SEL_POST</name>
              <description>Delay cells added on the feedback clock between CLK_OUT and CLK_POST</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TAP_SEL_OUT</name>
              <description>Delay cells added on the feedback clock between CLK_PRE and CLK_OUT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TAP_SEL_PRE</name>
              <description>TAP_SEL_PRE</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRE_ERR</name>
              <description>PRE error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VEND_SPEC</name>
          <description>Vendor Specific Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x30007809</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AC12_WR_CHKBUSY_EN</name>
              <description>Check busy enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AC12_WR_CHKBUSY_EN_a</name>
                  <description>Do not check busy after auto CMD12 for write data packet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC12_WR_CHKBUSY_EN_b</name>
                  <description>Check busy after auto CMD12 for write data packet</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRC_SDCLK_ON</name>
              <description>Force CLK</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRC_SDCLK_ON_a</name>
                  <description>CLK active or inactive is fully controlled by the hardware.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRC_SDCLK_ON_B</name>
                  <description>Force CLK active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_CHK_DIS</name>
              <description>CRC Check Disable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_CHK_DIS_a</name>
                  <description>Check CRC16 for every read data packet and check CRC fields for every write data packet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_CHK_DIS_B</name>
                  <description>Ignore CRC16 check for every read data packet and ignore CRC fields check for every write data packet</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMD_BYTE_EN</name>
              <description>Register byte access for CMD_XFR_TYP</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMD_BYTE_EN_a</name>
                  <description>Disable. MIX_CTRL[7:0] is read/write and CMD_XFR_TYP[7:0] is read-only.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_BYTE_EN_b</name>
                  <description>Enable. MIX_CTRL[7:0] is read-only and CMD_XFR_TYP[7:0] is read/write.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MMC_BOOT</name>
          <description>eMMC Boot</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTOCV_ACK</name>
              <description>Boot ACK time out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTOCV_ACK_a</name>
                  <description>SDCLK x 2^14</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_b</name>
                  <description>SDCLK x 2^15</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_c</name>
                  <description>SDCLK x 2^16</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_d</name>
                  <description>SDCLK x 2^17</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_e</name>
                  <description>SDCLK x 2^18</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_f</name>
                  <description>SDCLK x 2^19</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_g</name>
                  <description>SDCLK x 2^20</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_h</name>
                  <description>SDCLK x 2^21</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_i</name>
                  <description>SDCLK x 2^28</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_j</name>
                  <description>SDCLK x 2^29</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_ACK</name>
              <description>BOOT ACK</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOOT_ACK_a</name>
                  <description>No ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT_ACK_b</name>
                  <description>Ack</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_MODE</name>
              <description>Boot mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOOT_mode_a</name>
                  <description>Normal boot</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT_mode_b</name>
                  <description>Alternative boot</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_EN</name>
              <description>Boot enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOOT_en_a</name>
                  <description>Fast boot disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT_en_b</name>
                  <description>Fast boot enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTO_SABG_EN</name>
              <description>Auto stop at block gap</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_TIME_OUT</name>
              <description>Time out</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable_timeout_a</name>
                  <description>Enable time out</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable_timeout_b</name>
                  <description>Disable time out</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_BLK_CNT</name>
              <description>Stop At Block Gap value of automatic mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
